# 行定位符

# ^ 指定行的开始

# $ 指定行结尾

# =====================================================

# 元字符

# \b 匹配单词边界（开始或结束）

# . 匹配任意字符（除了换行符）

# \w 匹配字母、数字、下划线或汉字

# \W 匹配任意非单词字符（除了字母、数字、下划线或汉字）

# \s 匹配任意空白符（空格、制表符、换行符、中文全角空格等）

# \d 匹配任意数字

# \D 匹配任意非数字字符

# ======================================================

# 限定符

# ? 匹配前面的字符0次或一次；如：colou?r 该表达式可以匹配 color 或 colour

# + 匹配前面的字符一次或多次；如：go+gole 该表达式可匹配 gogle 或 go...gogle

# * 匹配前面的字符0此或多次；

# {n} 匹配前面的字符n次;如：a{2} 匹配 aa

# {n,} 匹配前面的字符至少n次;如：a{2,} 匹配 aa 或 aaa 或 a...aa 等

# {n,m} 匹配前面的字符至少n次，至多m次;如：a{2,4} 匹配 aa 或 aaa 或 aaaa

# ======================================================

# 字符类

# [abc] 匹配方括号中的任意字符，如：[abc] 匹配 a 或 b 或 c

# [^abc] 匹配除了方括号中的任意字符，如：[^abc] 匹配除了 a 或 b 或 c 的任意字符

# [a-zA-Z] 匹配任意字母（不区分大小写）

# [0-9] 匹配任意数字

# [^0-9] 匹配任意非数字字符

# [a-zA-Z0-9] 匹配任意字母或数字

# [^a-zA-Z0-9] 匹配任意非字母或数字字符

# =====================================================

# 选择字符

# | 匹配左右任意一个表达式，如：a|b 匹配 a 或 b

# () 匹配括号内的表达式，如：(a|b)c 匹配 ac 或 bc

# [] 匹配方括号中的任意字符，如：[abc] 匹配 a 或 b 或 c

# {} 匹配前一个字符的n次重复，如：a{2} 匹配 aa

# ====================================================

# practice1

# 身份证号码由18位或15位字符组成，若为15位则全为数字，若为18位则前17位为数字，最后一位为数字或字母X

# (\d{15}$)|(\d{17}[\dXx]$)

# ====================================================

# 转义字符

# \ 用于转义特殊字符，如：\. 匹配 . 字符，而不是任意字符

# =====================================================

print(r'\bm\w*\b')