id_card_provinces = {
    "11": "北京",
    "12": "天津",
    "13": "河北",
    "14": "山西",
    "15": "内蒙古",
    "21": "辽宁",
    "22": "吉林",
    "23": "黑龙江",
    "31": "上海",
    "32": "江苏",
    "33": "浙江",
    "34": "安徽",
    "35": "福建",
    "36": "江西",
    "37": "山东",
    "41": "河南",
    "42": "湖北",
    "43": "湖南",
    "44": "广东",
    "45": "广西",
    "46": "海南",
    "50": "重庆",
    "51": "四川",
    "52": "贵州",
    "53": "云南",
    "54": "西藏",
    "61": "陕西",
    "62": "甘肃",
    "63": "青海",
    "64": "宁夏",
    "65": "新疆",
    "71": "台湾",
    "81": "香港",
    "82": "澳门",
    "91": "国外",
}


# 我们的身份证号码中，前两位表示身份，再两位表示城市，再两位表示县，7~14位表示出生日期，15~16位表示出生序号，17位表示性别，18位表示校验码；请根据用户输入的身份证号获取对应省份信息。


idNumber = str(input("请输入您的身份证号码："))
while len(idNumber) != 18:
    print("请输入正确的身份证号码！！！")
    idNumber = str(input("请输入您的身份证号码："))

for item in id_card_provinces:
    if idNumber[0:2] == item:
        print(f"你是{id_card_provinces[item]}的")
        break

# 统计需要取快递人员名单


name_set = set()
while len(name_set) < 10:
    name = input("录入的姓名：")
    if name.lower() == "exit":
        break
    name_set.add(name)

print(name_set)
