# 一系列字符串方法

# ----------------------------------------------------------------

# 分割、合并字符串
# split(sep,maxsplit)


str11 = "合抱之木，生于毫末；九层之台，起于累土；千里之行，始于足下。"
# 按照，分割字符串
print(str11.split("，"))
# 最多分割一次
print(str11.split("，", 1))

# ----------------------------------------------------------------

join_str = ["合抱之木", "生于毫末；九层之台", "起于累土；千里之行", "始于足下。"]
print(",".join(join_str))

# ----------------------------------------------------------------
# 截取字符串
# string[start:end:step] 如列表一样，索引是从0开始的
str10 = "abcdefg"
print(f"截取第三个字符：{str10[2]}")
print(f"截取前两个字符：{str10[0:2]}")
print(f"截取所有字符，但隔一取一：{str10[0:len(str10):2]}")

# ----------------------------------------------------------------

# 编码
# encode()

str9 = "你好"

# 将字符串变量 str9 转换为 UTF-8 编码的字节序列
str_encode = str9.encode("utf-8")
print(str_encode)
# 解码回字符串
print(str_encode.decode("utf-8"))

# ----------------------------------------------------------------

# 查找与替换
# find(find_value)
# 返回查找内容在字符串中首次出现时的索引，不存在返回-1

str8 = "路曼曼其修远兮，吾将上下而求索。"

print(f"’哈哈哈’是否在’{str8}’中？{'在' if str8.find('哈哈哈') != -1 else '不在'}")

# ----------------------------------------------------------------

# rfind(find_value)
# 返回查找内容在字符串中最后出现时的索引，不存在返回-1

# ----------------------------------------------------------------

# count(find_value)
# 查找子字符串在字符串中出现的次数

# ----------------------------------------------------------------

# replace(old,new)
# 替换：将字符串中old字符串替换为new

# ----------------------------------------------------------------


# 大写（只针对字母）
# upper()
str1 = "abc"
print(f"大写后的{str1}变成{str1.upper()}")

# ----------------------------------------------------------------

# 小写
# lower()
str2 = "ABC"
print(f"小写后的{str2}变成{str2.lower()}")

# ----------------------------------------------------------------

# 将字母首字母大写其余小写
# capitalize

str3 = "abcde"
str4 = "ABCDE"

print(f"{str3}变成{str3.capitalize()}")
print(f"{str4}变成{str4.capitalize()}")

# ----------------------------------------------------------------

# 将字符串中每个单词首字母大写，其余小写
# title()

str5 = "go for it!"
str6 = "aBc d哈哈哈f great"

print(f"{str5}变成{str5.title()}")
print(f"{str6}变成{str6.title()}")

# ----------------------------------------------------------------

# 将字符串中字母大小写互换，即大写转小写，小写转大写
# swapcase()

str7 = "AbCdEfGh哈哈哈IjK"
print(f"{str7}变成{str7.swapcase()}")
